In [1]:
import pandas as pd

In [2]:
data = {
    'name':['Jerry', 'Riah', 'Paul'],
    'algol':['A', 'A+', 'B'],
    'basic':['C', 'B', 'B+'],
    'c++':['B+', 'C', 'C+']}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

    name algol basic c++
0  Jerry     A     C  B+
1   Riah    A+     B   C
2   Paul     B    B+  C+

In [5]:
# name column을 인덱스로 지정하려면?
df.set_index('name', inplace=True)

In [8]:
df

      algol basic c++
name
Jerry     A     C  B+
Riah     A+     B   C
Paul      B    B+  C+

# to csv

In [7]:
path = './df_student_sample.csv'
df.to_csv(path)

# to Excel

In [9]:
path = './df_student_sample_toExcel.xlsx'
df.to_excel(path)

In [11]:
data1 = {
    'name':['Jerry', 'Riah', 'Paul'],
    'algol':['A', 'A+', 'B'],
    'basic':['C', 'B', 'B+'],
    'c++':['B+', 'C', 'C+']}

data2 = {
    'c0':[1,2,3],
    'c1':[4, 5, 6],
    'c2':[7, 8, 9],
    'c3':[10, 11, 12],
    'c4':[13, 14, 15]}

df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)

df1.set_index('name', inplace=True)
df2.set_index('c0', inplace=True)

# Excel Writer

In [12]:
writer = pd.ExcelWriter('./df_excelwriter_1.xlsx')
df1.to_excel(writer, sheet_name='학점')
df2.to_excel(writer, sheet_name='sheet2')
writer.close()

In [16]:
writer = pd.ExcelWriter('./df_excelWriter-2.xlsx')
df1.to_excel(writer, sheet_name = '학점', startrow=0)
df2.to_excel(writer, sheet_name = '학점', startrow =len(df1) + 3)
writer.close()